/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：DISPLAY.c
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/
#include "DISPLAY.h"

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void LCD_DisplayS1S2(void)
 * 功能：显示 ScanIF模块的S1和S2源的状态值
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void LCD_DisplayS1S2(void)
{
	LCD_NUM2(SIFCTL3&0x01);						//显示S1
	LCD_NUM3((SIFCTL3&0x02)>>1);			//显示S2
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void LCD_DisplayCNT1(void)
 * 功能：显示计数器1的值
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void LCD_DisplayCNT1(void)
{
	uint8_t ge;
	uint8_t shi;
	shi = (SIFCNT&0x00ff)  / 16;
	ge = (SIFCNT&0x00ff) % 16;
	LCD_NUM4(shi);											//显示十位
	LCD_NUM5(ge);											//显示个位
}
void LCD_DisplayCNT1_10(void)
{
	uint8_t ge;
	uint8_t shi;
	uint8_t bai;
	bai = (SIFCNT&0x00ff)/100;
	shi = (SIFCNT&0x00ff) %100/10;
	ge = (SIFCNT&0x00ff) % 10;
	LCD_NUM1(bai);
	LCD_NUM2(shi);											//显示十位
	LCD_NUM3(ge);											//显示个位

}
void LCD_DisplayCNT2_10(void)
{
	uint8_t ge;
	uint8_t shi;
	uint8_t bai;
	bai = (SIFCNT>>8)/100;
	shi = (SIFCNT>>8) %100/10;
	ge = (SIFCNT>>8) % 10;
	LCD_NUM4(bai);
	LCD_NUM5(shi);											//显示十位
	LCD_NUM6(ge);											//显示个位
}
void LCD_DisplayS1S2_78(void)
{
	LCD_NUM7(SIFCTL3&0x01);						//显示S1
	LCD_NUM8((SIFCTL3&0x02)>>1);			//显示S2
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void LCD_DisplayCNT2(void)
 * 功能：显示计数器2的值
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：无
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void LCD_DisplayCNT2(void)
{
	uint8_t ge;
	uint8_t shi;
	shi = (SIFCNT&0x00ff)  / 16;
	ge = (SIFCNT&0x00ff) % 16;
	LCD_NUM6(shi);											//显示十位
	LCD_NUM7(ge);											//显示个位
}

void LCD_DisplayWaterVolume(void)
{
	extern uint32_t WaterVolume;
	LCD_NUM1(WaterVolume/10000000);
	LCD_NUM2(WaterVolume/1000000%10);
	LCD_NUM3(WaterVolume/100000%10);
	LCD_NUM4(WaterVolume/10000%10);
	LCD_NUM5(WaterVolume/1000%10);
	LCD_NUM6(WaterVolume/100%10);
	LCD_NUM7(WaterVolume/10%10);
	LCD_NUM8(WaterVolume%10);
}
