/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：InitY.c
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/
#include "Init.h"
#include "includes.h"

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void MSP430_Init(void)
 * 功能：MSP430初始化
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：根据使用的头文件初始化相应的模块
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void MSP430_Init(void)
{
	System_Init();
	GPIO_Init();
#ifdef SCANIF_H_
	ScanIF_Init();
#endif
#ifdef UART_H_
	UART_Init();
#endif
#ifdef LCD_H_
	LCD_Init();
	LCD_T3(ON);
	LCD_T4(ON);
#endif
#ifdef AT24C64_H_
	I2C_24C64_Init();
#endif
#ifdef	COMPARATOR_A_H_
	CMPA_Init();
#endif
#ifdef MOTOR_H_
	Motor_Init();
#endif
#ifdef BASICTIMER_H_
	BT_Init();
#endif
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void System_Init(void)
 * 功能：系统初始化，主要初始化看门狗和时钟
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void System_Init(void)
{
	WDTCTL = WDTPW+WDTHOLD;	// Stop watchdog timer
//	WDTCTL = WDT_ADLY_1000;
	FLL_CTL0 |= XCAP0PF;                     // Configure load caps
	BTCTL = 0x00;
//	WDTCTL = 0x5a0c ;
//	WDTCTL = WDT_ARST_1000;
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void GPIO_Init(void)
 * 功能：初始化GPIO为低电平输出，其余IO口需要使用时在对应的模块中另行改变
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void GPIO_Init(void)
{
	P1SEL = 0x00;
	P1DIR=0xff;
	P1OUT=0x00;
	P1DIR &=~(BIT1+BIT3);
	P2SEL = 0x00;
	P2DIR =0xff;
	P2OUT=0x00;
	P3SEL = 0x00;
	P3DIR=0xff;
	P3OUT=0;
	P4SEL = 0x00;
	P4DIR=0xff;
	P4OUT=0;
	P5SEL = 0x00;
	P5DIR=0xff;
	P5OUT=0;
	P6SEL = 0x00;
	P6DIR=0xff;
	P6OUT=0;
	P6DIR &=~BIT4;
	/*
	P1DIR = 0x00;
	P2DIR = 0x00;
	P3DIR = 0x00;
	P4DIR = 0x00;
	P5DIR = 0x00;
	P6DIR = 0x00;
	*/
}
