/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：Init.h
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/
#ifndef INIT_H_
#define INIT_H_

#include "includes.h"
#include <msp430.h>
#include <stdint.h>


void MSP430_Init(void);
void System_Init(void);
void GPIO_Init(void);


#endif /* INIT_H_ */
