/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：Motor.h
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：电机需要额外供电
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/
/*
 * K1		P1.5
 * K2		P1.4
 * */
#include "Motor.h"
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void Motor_Init(void)
 * 功能：电机IO口初始化
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void Motor_Init(void)
{
	K1SEL_GPIO;								//K1引脚设置为IO口模式
	K2SEL_GPIO;								//K2引脚设置为IO口模式
	K1DIR_OUTPUT;							//K1引脚设置为输出模式
	K2DIR_OUTPUT;							//K2引脚设置为输出模式
	MOTOR_STOP;							//K1,K2引脚输出低电平，关闭电机
}
void Motor_Open(void)
{
	uint32_t i;
	CMPA_Enable();
	for (i = 0; i < 10000; i++);
	MOTOR_OPEN;

}
void Motor_Close(void)
{
	uint32_t i;
	CMPA_Enable();
	for (i = 0; i < 10000; i++);
	MOTOR_CLOSE;
}
void Motor_Stop(void)
{
	CMPA_Disable();
	MOTOR_STOP;

}
