/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：Comparator_A.c
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/
#include "Comparator_A.h"
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void CMPA_Init(void)
 * 功能：比较器A初始化
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void CMPA_Init(void)
{
	/*--比较器A--CA1输入电压打开*/
	VREF_OUTPUT;
	VREF_RESET;
	/*--比较器A输入IO口初始化*/
	CMPA_PORT_DIR_INPUT;								//比较器A的引脚选择为输入模式
	CMPA_PORT_SEL;										//比较器A的输入引脚选择第二功能
	/*--比较器A寄存器初始化*/
	CACTL1 = CAON+CAIE;								//比较器A使能，比较器A中断使能（上升沿中断）
	CACTL2 = CAF + P2CA0 + P2CA1;				//输出结果滤波，1、2引脚都连接到比较器A
	CAPD = 0x00;												//打开P1.x的输入缓冲功能
	CMPA_Disable();
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：unsigned char CAP_Read_CAOUT(void)
 * 功能：读比较器A输出结果
 * 输入：无
 * 输出：unsigned char ：0/1，当CA1高于CA2时输出高电平，否则输出低电平
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void	CMPA_Enable(void)
{
	VREF_OUTPUT;
	VREF_SET;
	CACTL1 = CAON+CAIE;								//比较器A使能，比较器A中断使能（上升沿中断）
	CACTL2 = CAF + P2CA0 + P2CA1;				//输出结果滤波，1、2引脚都连接到比较器A
}
void	CMPA_Disable(void)
{
	VREF_RESET;
	CACTL1 = 0x00;
	CACTL2 = 0x00;
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：unsigned char CAP_Read_CAOUT(void)
 * 功能：读比较器A输出结果
 * 输入：无
 * 输出：unsigned char ：0/1，当CA1高于CA2时输出高电平，否则输出低电平
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
unsigned char CMPA_Read_CAOUT(void)
{
	return (CACTL2&BIT0);
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：__interrupt void CMP_ISR(void)
 * 功能：比较器A中断服务程序，关闭电机
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：复制该段至main文件
---------------------------------------------------------------------------------------------------------------------------------------------------*/
/*
#pragma	vector = COMPARATORA_VECTOR
__interrupt void CMP_ISR(void)
{
	MOTOR_STOP;
}
*/


