/*-----------------copyright(c)------------------------------------------------------------------------------------------------------------------*/
/*文件名：includes.h
 * 作者：李超
 * 时间：3015/3/18
 * 使用范围：MSP430FW427,适用于能联第一版的板子
 * 备注：
 *
 * */
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/

#include "UART.h"

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void UART_Init(void)
 * 功能：软件模拟串口初始化
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：使用TIMER_A的捕获比较功能模拟串口
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void UART_Init(void)
{
	P1DIR |= TXD;
	P1DIR &= ~RXD;
	P1SEL |= (TXD|RXD);
	TACTL = (TASSEL_1+MC_2);
//	TACCTL0 = OUT;							//old
	TACCTL0 = 0x00;
	RX_Ready();
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void TX_Ready(void)
 * 功能：做好发送准备，把RXTXData中的数据发送出去
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：程序暂停在该处，直到一个字符接收完
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void TX_Ready(void)
{

	BitCnt = 0x0a;
	TACCR0 = TAR;
	TACCR0 += BitTime;
	RXTXData |= 0x0100;
	RXTXData = RXTXData<<1;
	/*----------------------------------*
	BitCnt = 0x0d;
	TACCR0 = TAR;
	TACCR0 += BitTime;
	RXTXData |= 0x0100;
	RXTXData = RXTXData<<2;
	RXTXData |= 0x0001;
	*----------------------------------*/
	TACCTL0 = (OUTMOD0|CCIE);
	while(TACCTL0&CCIE);
	RX_Ready();
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void TX_Byte(char byte)
 * 功能：发送一个字符，往RXTXData中写一个字符，然后调用发送函数
 * 输入：char byte：要发送的字符
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void TX_Byte(unsigned char byte)
{
	TACTL = (TASSEL_1+MC_2);
	RXTXData = byte;
	TX_Ready();
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void TX_String(char *string)
 * 功能：发送一个字符串
 * 输入：char *string：要发送的字符串
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void TX_String(unsigned char *string)
{
	unsigned char i;
	for(i=0;string[i]!='\0';i++)
	{
		TX_Byte(string[i]);
	}
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void RX_Ready(void)
 * 功能：做好接受准备，准备接受一个字符
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/
void RX_Ready(void)
{
	BitCnt = 0x8;
//	TACTL = (TASSEL_1+MC_0);
	TACCTL0 = (CCIS_1+SCS+CM_2+CAP+CCIE+OUTMOD0);
}
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * 名称：void LCD_DisplayS1S2(void)
 * 功能：显示 ScanIF模块的S1和S2源的状态值
 * 输入：无
 * 输出：无
 * 作者：李超
 * 版本：1.0
 * 备注：
---------------------------------------------------------------------------------------------------------------------------------------------------*/



/*
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer_A(void)
{
	TACCR0 += BitTime;
	if(TACCTL0 & CCIS_1)
	//RX
	{
		if(TACCTL0 & CAP)
		{
			TACCTL0 &=~CAP;
			TACCR0 += BitTime_5;
		}
		else
		{

		      if(BitCnt == 0)
		      {
		      	TACCTL0 &= ~CCIE;
		 //---------------------------------------------
#ifdef	 FRAME_H_
		      	extern uint8_t stepFlag;
		      	Frame_Get();
		      	RX_Ready();
		      	if(stepFlag == STEP_END2)
		      		LPM3_EXIT;
#else
		 //--------------------------------------------
		      	LPM3_EXIT;
#endif
		      }
		      else
		      {
		    	  RXTXData = RXTXData >> 1;
				  if(TACCTL0&SCCI)
					  RXTXData |= 0x80;
				  BitCnt--;
		      }
		}
	}
	else
	//TX
	{
		if(BitCnt == 0)
			TACCTL0 &= ~CCIE;
		else
		{
			if(RXTXData & 0X01)									//如果最低位为高
			{
				TACCTL0 = (TACCTL0&~OUTMOD_7)|OUTMOD_1; 						//设置模式1：set
			}
			else
			{
				TACCTL0 = (TACCTL0&~OUTMOD_7)|OUTMOD_5; 						//设置模式5：reset
			}
			RXTXData = RXTXData >> 1;						//收发缓冲器右移一位
			BitCnt --;													//发送位计数减一
		}
	}
}

*/





